---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BRepBuilderPersistentIds
source: html/8301502b-fa62-6a73-89fe-9a71a3a44e56.htm
---
# BRepBuilderPersistentIds Members

Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.